<a href="https://colab.research.google.com/github/Dominic2681998/Data_Science/blob/main/startup_multipleLinearDummies.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.metrics import r2_score
from sklearn.linear_model import LinearRegression

In [ ]:
startup=pd.read_csv("startups.csv")
startup.head()

   R&D Spend  Administration  ...     Profit Unnamed: 5
0  165349.20       136897.80  ...  192261.83        NaN
1  162597.70       151377.59  ...  191792.06        NaN
2  153441.51       101145.55  ...  191050.39        NaN
3  144372.41       118671.85  ...  182901.99        NaN
4  142107.34        91391.77  ...  166187.94        NaN

[5 rows x 6 columns]

In [ ]:
dummy=pd.get_dummies(startup["State"])
df=pd.concat([dummy,startup],axis=1)
df.head()

   California  Florida  New York  ...       State     Profit  Unnamed: 5
0           0        0         1  ...    New York  192261.83         NaN
1           1        0         0  ...  California  191792.06         NaN
2           0        1         0  ...     Florida  191050.39         NaN
3           0        0         1  ...    New York  182901.99         NaN
4           0        1         0  ...     Florida  166187.94         NaN

[5 rows x 9 columns]

In [ ]:
df.drop(["State"],inplace=True,axis=1)
df.head()

   California  Florida  New York  ...  Marketing Spend     Profit  Unnamed: 5
0           0        0         1  ...        471784.10  192261.83         NaN
1           1        0         0  ...        443898.53  191792.06         NaN
2           0        1         0  ...        407934.54  191050.39         NaN
3           0        0         1  ...        383199.62  182901.99         NaN
4           0        1         0  ...        366168.42  166187.94         NaN

[5 rows x 8 columns]

In [ ]:
x=df.iloc[:,:-1]
y=df.iloc[:,6]
x.head()

   California  Florida  New York  ...  Administration  Marketing Spend     Profit
0           0        0         1  ...       136897.80        471784.10  192261.83
1           1        0         0  ...       151377.59        443898.53  191792.06
2           0        1         0  ...       101145.55        407934.54  191050.39
3           0        0         1  ...       118671.85        383199.62  182901.99
4           0        1         0  ...        91391.77        366168.42  166187.94

[5 rows x 7 columns]

In [ ]:
y.head()

0    192261.83
1    191792.06
2    191050.39
3    182901.99
4    166187.94
Name: Profit, dtype: float64

In [ ]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=.2,random_state=42)

In [ ]:
multiple=LinearRegression()
multiple.fit(x_train,y_train)

LinearRegression()

In [ ]:
predict=multiple.predict(x_test)
predict

array([134307.35,  81005.76,  99937.59,  64926.08, 125370.37,  35673.41,
       105733.54, 107404.34,  97427.84, 122776.86])

In [ ]:
print("R2 Score:",r2_score(y_test,predict))

R2 Score: 1.0